class Text:
    text: dict[str, tuple[str] | str] = {}

    def __init__(self):
        self.text['start_message'] = '''<strong>Мы эксперты в МЛМ.</strong> 

Наш опыт основывается на практике!

<i>Именно поэтому мы даем комплексное обучение, которое поможет правильно запустить новичка, научить делать продажи на автомате и стать крутым рекрутером.</i>

Пошаговое внедрение и простота подачи информации.

Современные инструменты для автоматизации 

Чат боты - отлично справляются с рутинной работой и привлекают клиентов и партнеров. Наши партнеры получают их БЕСПЛАТНО!

Краткий обзор ступеней обучения:

Интенсив "Как заработать первые деньги"

7-ми дневный практикум с подробными механиками первичной упаковки соц сетей. 

Ты научишься зарабатывать на продажах и начнешь развивать свою команду.

<span class="tg-spoiler">80% партнеров, которые следуют нашим инструкциям зарабатывают в первую неделю от 5000 руб. Здорово, правда?</span>

"Рекрутеры" - закрытый чат с обучением для активных партнеров.

Поддержка 24/7. Разбор обучения, ответы на вопросы, помощь с диалогами и настройкой соц сетей для привлечения партнеров.

Практикум "Рекрутинг Нон-Стоп"

Для тех, кто хочет построить большую команду и иметь неограниченный и растущий доход.

Пошаговое обучение. Методики, которые дают системность действий и помогут получать минимум 1 регистрацию в день.

<span class="tg-spoiler">Турборост. Для тех, кто любит работать с продуктом.</span> 

Секретные фишки для привлечения клиентов и превращения их в партнеров.

Ты узнаешь почему в Siberian Wellness продажи в удовольствие и приносят хороший доход

Личный бренд от Бэка

Для тех, кто полностью внедрился и начал выходить на результат - развитие личного (экспертного) бренда. Закрытое обучение от компании Siberian Wellness.

А также, важно отметить, что большое количество курсов дает и сама компания. 

<u>В личном кабинете партнера ты найдешь курсы по соц сетям, вебинары по продуктам, управлению личными финансами и многое другое.</u>

<span class="tg-spoiler">Начать обучение и попасть на Интенсив Как заработать первые деньги можно сразу после регистрации</span>'''
        self.text['btn_continue_start'] = 'Но это еще не все 😱. Все намного интересней!'
        self.text['btn_continue_start_2'] = 'Давай знакомиться!'
        self.text['continue_start_2'] = '''<strong>Привет 👋 и спасибо что проявил интерес к моему предложению.</strong> 

Пара слов обо мне . 

Меня зовут Дмитрий,супругу Раушан . 

Мы 27 лет в браке . 
Имеем 4 сына и более 10 лет успешно строим бизнес в сетевой индустрии . 

Для долгосрочных отношений мы выбрали надежную компанию с колоссальным производственным масштабом - Siberian Wellness. 

На сегодняшний день моя команда самая быстрорастущая по рекрутингу и товарообороту на территории СНГ . 

 В 2022 ГОДУ мы стали самыми быстрыми топ лидерами Siberian Wellness за все 27 лет .

Только за 10 месяцев 2023 года партнеры моей команды заработали 134.000.000₽ ! 

Я говорю об этой цифре только для то что бы было понимание , что партнёры в моей команде с деньгами 

В других разделах , моего бота , ты узнаешь почему у нас такой рост , по какой системе мы работаем , какие инструменты и решения мы предлагаем . 

Выбирай следующий раздел и погнали 🚀'''
        self.text['input_sections'] = 'Нажми на /sections!'
        self.text['sections_title'] = 'Разделы'
        self.text['btn_sections_1'] = 'Возможности Siberian Wellness'
        self.text['btn_sections_2'] = 'Автопрограмма'
        self.text['btn_sections_3'] = 'О продукте SW'
        self.text['btn_sections_4'] = 'Сколько компания платит'
        self.text['btn_sections_5'] = 'Стать партнером'
        self.text['btn_sections_6'] = 'Стать клиентом'
        self.text['btn_sections_7'] = 'Как заработать 5000р за 3 дня'
        self.text['btn_sections_8'] = 'Бонусные программы'
        self.text['btn_sections_9'] = 'Результаты моих партнеров'
        self.text['section_1'] = '''Выбирать бизнес , компанию , команду , наставника - это как купить дом мечты на всю жизнь . 

Видео выше о возможностях компании идет 25 мин и ты можешь сказать : у меня нет времени столько смотреть! 

Но если ты хочешь увидеть всю картину возможностей, которая поможет тебе принять правильное решение , то рекомендую найти время .

НО ПОТОМ СНОВА ВОЗВРАЩАЙСЯ СЮДА ! '''
        self.text['section_2'] = '''Siberian Wellness Car — это проект успешных автомобилистов. 

Участвуя в АВТОпроекте, Бизнес-Партнеры Siberian Wellness имеют возможность на выгодных условиях приобрести новый автомобиль.

Условия действительно уникальные и простые . 

 Автопрграмма включается при товарном обороте твоей организации всего лишь 800.000₽ 

 Любая машина на выбор ! Можно даже Б/У 

 Автобонус ты получаешь от прироста Т.О , а не от удержания ранга . Поэтому здесь автопрограмму закрывают за 1-1,5 года . При этом сама программа работает 4 года .

 Для уточняющих вопросов можно написать мне прямо ЛС https://t.me/rich_biz
'''
        self.text['section_3.1'] = '''Основные продуктовые направления Siberian Wellness

Витамины  в том числе для детей, беременных и кормящих мам, БАДы 

Спортивное питание

Еда для похудения, батончики,  мармеладки, коктейли, напитки

Травяные сборы и фиточаи

Сибирские бальзамы

Натуральная уходовая и декоративная  косметика

Средства личной гигиены 

Селективная парфюмерия и в стиле известных брендов

 КАТАЛОГ https://catalog.siberianhealth.com/ru/?page=6

Цена появляется если нажать +
'''
        self.text['section_3.2'] = '''В мире 190 стран, и в 65 из них можно купить наш продукт. 

В компании собственный научно инновационный центр, свои лаборатории и свое производство. Это гарантирует качество НА ВСЕХ ЭТАПАХ.

Производство сертифицировано по самым современным стандартам качества (ISO, GMP, НАССР), а также внесено в реестр FDA, является обладателем сертификата HALAL - одного из самых требовательных стандартов мира.'''
        self.text['section_4'] = '''Маркетинг основа основ и наши деньги. 

Вам необходимо  уметь считать и понимать за что платят.

Смотри видео, где подробно рассказано о всех выгодах нашего маркетинг плана.

 Для уточняющих вопросов можно написать мне прямо ЛС https://t.me/rich_biz'''
        self.text['section_5'] = 'https://ru.siberianhealth.com/ru/shop/user/registration/CONSULTANT/?ref=2508126122'
        self.text['section_6'] = 'https://ru.siberianhealth.com/ru/shop/user/registration/PRIVILEGED_CLIENT/?ref=2508126122'
        self.text['section_7.1'] = '''Я знаю, что ты не знаешь где брать людей в команду🧐

 А я скажу тебе, что знаю как это сделать через продукт, да так, что они сами проситься к тебе будут в команду! 

Хочешь научу?

 В понедельник мы запускаем наш 3х дневный интенсив , где научим тебя получать первых партнёров и клиентов без списка знакомых и беготни с каталогами !

Мы не учим продавать, мы учим создавать ситуации, когда люди сами хотят ПОКУПАТЬ! 

НЕ ВАЖНО ЧТО :  продукт или партнерство! 

В понедельник мы запускаем снова такой практикум и в течение которого ты получишь:

технологию создания чата-воронки, который будет приводить к тебе первых клиентов и партнеров 

скрипты безотказного приглашения людей

за первых 3 дня ты создашь движуху с помощью секретных триггеров, когда твои потенциальные клиенты с благодарностью будут у тебя покупать все!

ты узнаешь фишки БОЛЬШИХ ПРОДАЖ 

ты узнаешь технологию, как за 3 дня делать продажи на 100 тыс. рублей и выходить на Лидерские квалификации 

Ну как тебе?! Но это ещё не все !!!!

Все участники нашего Интенсива получат БОНУС НОВОГО МЕТОДА, который приведёт к тебе партнёров уже на 14 дней БЕСПЛАТНО !!!

Торопись !!! Стартуем уже в понедельник !!! Осталось мало времени !!!

 Пиши в лс https://t.me/rich_biz'''
        self.text['section_7.2'] = 'Отзывы этого потока ☝️☝️☝️ 0% сомнений! 100% Легко!'
        self.text['section_8'] = '''У нас ты найдешь огромное количество программ для исполнения своих мечт!

Посмотри видео и оцени масштабы'''
        self.text['section_9.1'] = '''Максим пришел ко мне в команду из другой компании где вышел на доход 250.000 р спустя 3,5 года . 

А спустя 6 месяцев  у меня в команде он уже вышел на доход 700.000₽ благодаря нашей системе обучения .

Ты можешь спросить: но разве с такими деньгами меняют компанию ?

Ну послушай его сам'''
        self.text['section_9.2'] = '''Олеся , для нее это тоже не первая компания . Максимальный доход в предыдущей был 400.000 р . 

Потом было сильнейшее выгорание , когда она совсем оставила сетевой и уже не верила в себя , а сегодня у нее огромная команда и спустя 1,5 года она уже с доходом 600.000 р , тоже благодаря нашей системе обучения . 

Вот ее первые эмоции в моменте старта спустя всего 2 месяца 
'''
        self.text['section_9.3'] = '''Таких историй десятки ! Все кто пришел ко мне в команду переживают одно и тоже - РОСТ . 

Без бесконечных зумов и мотиваций ! 

Никаких выгораний !
Только органический рост , благодаря нашей системе и моей поддержке на каждом этапе 

Напиши мне в ЛС - ХОЧУ В КОМАНДУ https://t.me/rich_biz и через полгода - год ты скажешь спасибо!
'''
        self.text['admin_newsletter_1'] = 'Введите сообщение вместе с командой /admin_newsletter. \nОбразец: /admin_newsletter Привет!'
